alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/pp0/m400_pp_0_ibr02_run.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:58:34 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "MaliFns.h"
#include "m400_pp_0_ibr02_check_0_a.h"
#include "m400_pp_0_ibr02_check_0_b.h"
#include "m400_pp_0_ibr02_check_0_c.h"
#include "m400_pp_0_ibr02_check_0_d.h"
#include "m400_pp_0_ibr02_check_0_e.h"
#include "m400_pp_0_ibr02_check_0_f.h"
#include "m400_pp_0_ibr02_check_0_g.h"
#include "m400_pp_0_ibr02_check_0_h.h"
#include "m400_pp_0_ibr02_check_0_i.h"
#include "m400_pp_0_ibr02_check_0_j.h"
#include "m400_pp_0_ibr02_check_0_k.h"
#include "m400_pp_0_ibr02_check_0_l.h"
#include "m400_pp_0_ibr02_check_0_m.h"
#include "m400_pp_0_ibr02_check_0_n.h"
#include "m400_pp_0_ibr02_check_0_o.h"

int Check_m400_pp_0_ibr02_check_0_a ();
int Check_m400_pp_0_ibr02_check_0_b ();
int Check_m400_pp_0_ibr02_check_0_c ();
int Check_m400_pp_0_ibr02_check_0_d ();
int Check_m400_pp_0_ibr02_check_0_e ();
int Check_m400_pp_0_ibr02_check_0_f ();
int Check_m400_pp_0_ibr02_check_0_g ();
int Check_m400_pp_0_ibr02_check_0_h ();
int Check_m400_pp_0_ibr02_check_0_i ();
int Check_m400_pp_0_ibr02_check_0_j ();
int Check_m400_pp_0_ibr02_check_0_k ();
int Check_m400_pp_0_ibr02_check_0_l ();
int Check_m400_pp_0_ibr02_check_0_m ();
int Check_m400_pp_0_ibr02_check_0_n ();
int Check_m400_pp_0_ibr02_check_0_o ();

int RunMaliTest_m400_pp_0_ibr02_part0 (void);

static int mali_step;

int RunMaliTest_m400_pp_0_ibr02 (int init) {
  if (init) { mali_step = 0; };
  switch (mali_step) {
    case 0  : return RunMaliTest_m400_pp_0_ibr02_part0();
    default : return 0;
  };
};

int RunMaliTest_m400_pp_0_ibr02_part0 (void) {
  int res = 0;
  printf("RUNNING TEST: m400_pp_0_ibr02\n");

  /* COMMENT */                                      /* #IBR02 Mali200 */
  Mali_Reset();                                      /* reset */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* # Write all ones */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* #- Frame registers */
  Mali_WrReg(0x1,0x0,0x0,0xffffffff);                /* writereg 10000000 ffffffff */
  Mali_WrReg(0x1,0x0,0x4,0xffffffff);                /* writereg 10000004 ffffffff */
  Mali_WrReg(0x1,0x0,0x8,0xffffffff);                /* writereg 10000008 ffffffff */
  Mali_WrReg(0x1,0x0,0xc,0xffffffff);                /* writereg 1000000c ffffffff */
  Mali_WrReg(0x1,0x0,0x10,0xffffffff);               /* writereg 10000010 ffffffff */
  Mali_WrReg(0x1,0x0,0x14,0xffffffff);               /* writereg 10000014 ffffffff */
  Mali_WrReg(0x1,0x0,0x18,0xffffffff);               /* writereg 10000018 ffffffff */
  Mali_WrReg(0x1,0x0,0x1c,0xffffffff);               /* writereg 1000001c ffffffff */
  Mali_WrReg(0x1,0x0,0x20,0xffffffff);               /* writereg 10000020 ffffffff */
  Mali_WrReg(0x1,0x0,0x24,0xffffffff);               /* writereg 10000024 ffffffff */
  Mali_WrReg(0x1,0x0,0x28,0xffffffff);               /* writereg 10000028 ffffffff */
  Mali_WrReg(0x1,0x0,0x2c,0xffffffff);               /* writereg 1000002c ffffffff */
  Mali_WrReg(0x1,0x0,0x30,0xffffffff);               /* writereg 10000030 ffffffff */
  Mali_WrReg(0x1,0x0,0x34,0xffffffff);               /* writereg 10000034 ffffffff */
  Mali_WrReg(0x1,0x0,0x38,0xffffffff);               /* writereg 10000038 ffffffff */
  Mali_WrReg(0x1,0x0,0x3c,0xffffffff);               /* writereg 1000003c ffffffff */
  Mali_WrReg(0x1,0x0,0x40,0xffffffff);               /* writereg 10000040 ffffffff */
  Mali_WrReg(0x1,0x0,0x44,0xffffffff);               /* writereg 10000044 ffffffff */
  Mali_WrReg(0x1,0x0,0x48,0xffffffff);               /* writereg 10000048 ffffffff */
  Mali_WrReg(0x1,0x0,0x4c,0xffffffff);               /* writereg 1000004c ffffffff */
  Mali_WrReg(0x1,0x0,0x50,0xffffffff);               /* writereg 10000050 ffffffff */
  Mali_WrReg(0x1,0x0,0x54,0xffffffff);               /* writereg 10000054 ffffffff */
  /* COMMENT */                                      /* #- Writeback registers WB0 */
  Mali_WrReg(0x1,0x0,0x100,0xffffffff);              /* writereg 10000100 ffffffff */
  Mali_WrReg(0x1,0x0,0x104,0xffffffff);              /* writereg 10000104 ffffffff */
  Mali_WrReg(0x1,0x0,0x108,0xffffffff);              /* writereg 10000108 ffffffff */
  Mali_WrReg(0x1,0x0,0x10c,0xffffff00);              /* writereg 1000010c ffffff00 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x110,0xffffffff);              /* writereg 10000110 ffffffff */
  Mali_WrReg(0x1,0x0,0x114,0xffffffff);              /* writereg 10000114 ffffffff */
  Mali_WrReg(0x1,0x0,0x118,0xffffffff);              /* writereg 10000118 ffffffff */
  Mali_WrReg(0x1,0x0,0x11c,0xffffffff);              /* writereg 1000011c ffffffff */
  Mali_WrReg(0x1,0x0,0x120,0xffffffff);              /* writereg 10000120 ffffffff */
  Mali_WrReg(0x1,0x0,0x124,0xffffffff);              /* writereg 10000124 ffffffff */
  Mali_WrReg(0x1,0x0,0x128,0xffffffff);              /* writereg 10000128 ffffffff */
  Mali_WrReg(0x1,0x0,0x12c,0xffffffff);              /* writereg 1000012c ffffffff */
  /* COMMENT */                                      /* #- Writeback registers WB1 */
  Mali_WrReg(0x1,0x0,0x200,0xffffffff);              /* writereg 10000200 ffffffff */
  Mali_WrReg(0x1,0x0,0x204,0xffffffff);              /* writereg 10000204 ffffffff */
  Mali_WrReg(0x1,0x0,0x208,0xffffffff);              /* writereg 10000208 ffffffff */
  Mali_WrReg(0x1,0x0,0x20c,0xffffff00);              /* writereg 1000020c ffffff00 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x210,0xffffffff);              /* writereg 10000210 ffffffff */
  Mali_WrReg(0x1,0x0,0x214,0xffffffff);              /* writereg 10000214 ffffffff */
  Mali_WrReg(0x1,0x0,0x218,0xffffffff);              /* writereg 10000218 ffffffff */
  Mali_WrReg(0x1,0x0,0x21c,0xffffffff);              /* writereg 1000021c ffffffff */
  Mali_WrReg(0x1,0x0,0x220,0xffffffff);              /* writereg 10000220 ffffffff */
  Mali_WrReg(0x1,0x0,0x224,0xffffffff);              /* writereg 10000224 ffffffff */
  Mali_WrReg(0x1,0x0,0x228,0xffffffff);              /* writereg 10000228 ffffffff */
  Mali_WrReg(0x1,0x0,0x22c,0xffffffff);              /* writereg 1000022c ffffffff */
  /* COMMENT */                                      /* #- Writeback registers WB2 */
  Mali_WrReg(0x1,0x0,0x300,0xffffffff);              /* writereg 10000300 ffffffff */
  Mali_WrReg(0x1,0x0,0x304,0xffffffff);              /* writereg 10000304 ffffffff */
  Mali_WrReg(0x1,0x0,0x308,0xffffffff);              /* writereg 10000308 ffffffff */
  Mali_WrReg(0x1,0x0,0x30c,0xffffff00);              /* writereg 1000030c ffffff00 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x310,0xffffffff);              /* writereg 10000310 ffffffff */
  Mali_WrReg(0x1,0x0,0x314,0xffffffff);              /* writereg 10000314 ffffffff */
  Mali_WrReg(0x1,0x0,0x318,0xffffffff);              /* writereg 10000318 ffffffff */
  Mali_WrReg(0x1,0x0,0x31c,0xffffffff);              /* writereg 1000031c ffffffff */
  Mali_WrReg(0x1,0x0,0x320,0xffffffff);              /* writereg 10000320 ffffffff */
  Mali_WrReg(0x1,0x0,0x324,0xffffffff);              /* writereg 10000324 ffffffff */
  Mali_WrReg(0x1,0x0,0x328,0xffffffff);              /* writereg 10000328 ffffffff */
  Mali_WrReg(0x1,0x0,0x32c,0xffffffff);              /* writereg 1000032c ffffffff */
  /* COMMENT */                                      /* #- Management registers */
  Mali_WrReg(0x1,0x0,0x1000,0xffffffff);             /* writereg 10001000 ffffffff */
  Mali_WrReg(0x1,0x0,0x1004,0xffffffff);             /* writereg 10001004 ffffffff */
  Mali_WrReg(0x1,0x0,0x1008,0xffffffff);             /* writereg 10001008 ffffffff */
  /* COMMENT */                                      /* # Skip Control Management register at 0x100c */
  Mali_WrReg(0x1,0x0,0x1010,0xffffffff);             /* writereg 10001010 ffffffff */
  Mali_WrReg(0x1,0x0,0x1014,0xffffffff);             /* writereg 10001014 ffffffff */
  Mali_WrReg(0x1,0x0,0x1018,0xffffffff);             /* writereg 10001018 ffffffff */
  Mali_WrReg(0x1,0x0,0x101c,0xffffffff);             /* writereg 1000101c ffffffff */
  Mali_WrReg(0x1,0x0,0x1020,0xffffffff);             /* writereg 10001020 ffffffff */
  /* COMMENT */                                      /* # Skip Interrupt Clear register at 0x1024 */
  Mali_WrReg(0x1,0x0,0x1028,0xffffffff);             /* writereg 10001028 ffffffff */
  Mali_WrReg(0x1,0x0,0x102c,0xffffffff);             /* writereg 1000102c ffffffff */
  Mali_WrReg(0x1,0x0,0x1030,0xffffffff);             /* writereg 10001030 ffffffff */
  Mali_WrReg(0x1,0x0,0x1034,0xffffffff);             /* writereg 10001034 ffffffff */
  Mali_WrReg(0x1,0x0,0x1038,0xffffffff);             /* writereg 10001038 ffffffff */
  Mali_WrReg(0x1,0x0,0x103c,0xffffffff);             /* writereg 1000103c ffffffff */
  Mali_WrReg(0x1,0x0,0x1040,0xffffffff);             /* writereg 10001040 ffffffff */
  Mali_WrReg(0x1,0x0,0x1044,0xffffffff);             /* writereg 10001044 ffffffff */
  Mali_WrReg(0x1,0x0,0x1048,0xffffffff);             /* writereg 10001048 ffffffff */
  Mali_WrReg(0x1,0x0,0x104c,0xffffffff);             /* writereg 1000104c ffffffff */
  Mali_WrReg(0x1,0x0,0x1050,0xffffffff);             /* writereg 10001050 ffffffff */
  Mali_WrReg(0x1,0x0,0x1054,0xffffffff);             /* writereg 10001054 ffffffff */
  Mali_WrReg(0x1,0x0,0x1058,0xffffffff);             /* writereg 10001058 ffffffff */
  Mali_WrReg(0x1,0x0,0x105c,0xffffffff);             /* writereg 1000105c ffffffff */
  Mali_WrReg(0x1,0x0,0x1060,0xffffffff);             /* writereg 10001060 ffffffff */
  Mali_WrReg(0x1,0x0,0x1064,0xffffffff);             /* writereg 10001064 ffffffff */
  Mali_WrReg(0x1,0x0,0x1068,0xffffffff);             /* writereg 10001068 ffffffff */
  Mali_WrReg(0x1,0x0,0x106c,0xffffffff);             /* writereg 1000106c ffffffff */
  Mali_WrReg(0x1,0x0,0x1070,0xffffffff);             /* writereg 10001070 ffffffff */
  Mali_WrReg(0x1,0x0,0x1074,0xffffffff);             /* writereg 10001074 ffffffff */
  Mali_WrReg(0x1,0x0,0x1078,0xffffffff);             /* writereg 10001078 ffffffff */
  Mali_WrReg(0x1,0x0,0x107c,0xffffffff);             /* writereg 1000107c ffffffff */
  Mali_WrReg(0x1,0x0,0x1080,0xffffffff);             /* writereg 10001080 ffffffff */
  Mali_WrReg(0x1,0x0,0x1084,0xffffffff);             /* writereg 10001084 ffffffff */
  Mali_WrReg(0x1,0x0,0x1088,0xffffffff);             /* writereg 10001088 ffffffff */
  Mali_WrReg(0x1,0x0,0x108c,0xffffffff);             /* writereg 1000108c ffffffff */
  Mali_WrReg(0x1,0x0,0x1090,0xffffffff);             /* writereg 10001090 ffffffff */
  Mali_WrReg(0x1,0x0,0x1094,0xffffffff);             /* writereg 10001094 ffffffff */
  Mali_WrReg(0x1,0x0,0x1098,0xffffffff);             /* writereg 10001098 ffffffff */
  Mali_WrReg(0x1,0x0,0x109c,0xffffffff);             /* writereg 1000109c ffffffff */
  Mali_WrReg(0x1,0x0,0x10a0,0xffffffff);             /* writereg 100010a0 ffffffff */
  Mali_WrReg(0x1,0x0,0x10a4,0xffffffff);             /* writereg 100010a4 ffffffff */
  Mali_WrReg(0x1,0x0,0x10a8,0xffffffff);             /* writereg 100010a8 ffffffff */
  Mali_WrReg(0x1,0x0,0x10ac,0xffffffff);             /* writereg 100010ac ffffffff */
  Mali_WrReg(0x1,0x0,0x10b0,0xffffffff);             /* writereg 100010b0 ffffffff */
  Mali_WrReg(0x1,0x0,0x10b4,0xffffffff);             /* writereg 100010b4 ffffffff */
  Mali_WrReg(0x1,0x0,0x10b8,0xffffffff);             /* writereg 100010b8 ffffffff */
  Mali_WrReg(0x1,0x0,0x10bc,0xffffffff);             /* writereg 100010bc ffffffff */
  /* COMMENT */                                      /* #- Dump */
  res |= Check_m400_pp_0_ibr02_check_0_a();          /* dump_reg 10000000 10000058 > ibr02_00000_reg.hex # Frame registers */
  res |= Check_m400_pp_0_ibr02_check_0_b();          /* dump_reg 10000100 10000130 > ibr02_00001_reg.hex # Writeback Registers for WB0 */
  res |= Check_m400_pp_0_ibr02_check_0_c();          /* dump_reg 10000200 10000230 > ibr02_00002_reg.hex # Writeback Registers for WB1 */
  res |= Check_m400_pp_0_ibr02_check_0_d();          /* dump_reg 10000300 10000330 > ibr02_00003_reg.hex # Writeback Registers for WB2 */
  res |= Check_m400_pp_0_ibr02_check_0_e();          /* dump_reg 10001000 100010b8 > ibr02_00004_reg.hex # Management registers */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* # Write all zeros */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* #- Frame registers */
  Mali_WrReg(0x1,0x0,0x0,0x00000000);                /* writereg 10000000 00000000 */
  Mali_WrReg(0x1,0x0,0x4,0x00000000);                /* writereg 10000004 00000000 */
  Mali_WrReg(0x1,0x0,0x8,0x00000000);                /* writereg 10000008 00000000 */
  Mali_WrReg(0x1,0x0,0xc,0x00000000);                /* writereg 1000000c 00000000 */
  Mali_WrReg(0x1,0x0,0x10,0x00000000);               /* writereg 10000010 00000000 */
  Mali_WrReg(0x1,0x0,0x14,0x00000000);               /* writereg 10000014 00000000 */
  Mali_WrReg(0x1,0x0,0x18,0x00000000);               /* writereg 10000018 00000000 */
  Mali_WrReg(0x1,0x0,0x1c,0x00000000);               /* writereg 1000001c 00000000 */
  Mali_WrReg(0x1,0x0,0x20,0x00000000);               /* writereg 10000020 00000000 */
  Mali_WrReg(0x1,0x0,0x24,0x00000000);               /* writereg 10000024 00000000 */
  Mali_WrReg(0x1,0x0,0x28,0x00000000);               /* writereg 10000028 00000000 */
  Mali_WrReg(0x1,0x0,0x2c,0x00000000);               /* writereg 1000002c 00000000 */
  Mali_WrReg(0x1,0x0,0x30,0x00000000);               /* writereg 10000030 00000000 */
  Mali_WrReg(0x1,0x0,0x34,0x00000000);               /* writereg 10000034 00000000 */
  Mali_WrReg(0x1,0x0,0x38,0x00000000);               /* writereg 10000038 00000000 */
  Mali_WrReg(0x1,0x0,0x3c,0x00000000);               /* writereg 1000003c 00000000 */
  Mali_WrReg(0x1,0x0,0x40,0x00000000);               /* writereg 10000040 00000000 */
  Mali_WrReg(0x1,0x0,0x44,0x00000000);               /* writereg 10000044 00000000 */
  Mali_WrReg(0x1,0x0,0x48,0x00000000);               /* writereg 10000048 00000000 */
  Mali_WrReg(0x1,0x0,0x4c,0x00000000);               /* writereg 1000004c 00000000 */
  Mali_WrReg(0x1,0x0,0x50,0x00000000);               /* writereg 10000050 00000000 */
  Mali_WrReg(0x1,0x0,0x54,0x00000000);               /* writereg 10000054 00000000 */
  /* COMMENT */                                      /* #- Writeback registers WB0 */
  Mali_WrReg(0x1,0x0,0x100,0x00000000);              /* writereg 10000100 00000000 */
  Mali_WrReg(0x1,0x0,0x104,0x00000000);              /* writereg 10000104 00000000 */
  Mali_WrReg(0x1,0x0,0x108,0x00000000);              /* writereg 10000108 00000000 */
  Mali_WrReg(0x1,0x0,0x10c,0x00000000);              /* writereg 1000010c 00000000 */
  Mali_WrReg(0x1,0x0,0x110,0x00000000);              /* writereg 10000110 00000000 */
  Mali_WrReg(0x1,0x0,0x114,0x00000000);              /* writereg 10000114 00000000 */
  Mali_WrReg(0x1,0x0,0x118,0x00000000);              /* writereg 10000118 00000000 */
  Mali_WrReg(0x1,0x0,0x11c,0x00000000);              /* writereg 1000011c 00000000 */
  Mali_WrReg(0x1,0x0,0x120,0x00000000);              /* writereg 10000120 00000000 */
  Mali_WrReg(0x1,0x0,0x124,0x00000000);              /* writereg 10000124 00000000 */
  Mali_WrReg(0x1,0x0,0x128,0x00000000);              /* writereg 10000128 00000000 */
  Mali_WrReg(0x1,0x0,0x12c,0x00000000);              /* writereg 1000012c 00000000 */
  /* COMMENT */                                      /* #- Writeback registers WB1 */
  Mali_WrReg(0x1,0x0,0x200,0x00000000);              /* writereg 10000200 00000000 */
  Mali_WrReg(0x1,0x0,0x204,0x00000000);              /* writereg 10000204 00000000 */
  Mali_WrReg(0x1,0x0,0x208,0x00000000);              /* writereg 10000208 00000000 */
  Mali_WrReg(0x1,0x0,0x20c,0x00000000);              /* writereg 1000020c 00000000 */
  Mali_WrReg(0x1,0x0,0x210,0x00000000);              /* writereg 10000210 00000000 */
  Mali_WrReg(0x1,0x0,0x214,0x00000000);              /* writereg 10000214 00000000 */
  Mali_WrReg(0x1,0x0,0x218,0x00000000);              /* writereg 10000218 00000000 */
  Mali_WrReg(0x1,0x0,0x21c,0x00000000);              /* writereg 1000021c 00000000 */
  Mali_WrReg(0x1,0x0,0x220,0x00000000);              /* writereg 10000220 00000000 */
  Mali_WrReg(0x1,0x0,0x224,0x00000000);              /* writereg 10000224 00000000 */
  Mali_WrReg(0x1,0x0,0x228,0x00000000);              /* writereg 10000228 00000000 */
  Mali_WrReg(0x1,0x0,0x22c,0x00000000);              /* writereg 1000022c 00000000 */
  /* COMMENT */                                      /* #- Writeback registers WB2 */
  Mali_WrReg(0x1,0x0,0x300,0x00000000);              /* writereg 10000300 00000000 */
  Mali_WrReg(0x1,0x0,0x304,0x00000000);              /* writereg 10000304 00000000 */
  Mali_WrReg(0x1,0x0,0x308,0x00000000);              /* writereg 10000308 00000000 */
  Mali_WrReg(0x1,0x0,0x30c,0x00000000);              /* writereg 1000030c 00000000 */
  Mali_WrReg(0x1,0x0,0x310,0x00000000);              /* writereg 10000310 00000000 */
  Mali_WrReg(0x1,0x0,0x314,0x00000000);              /* writereg 10000314 00000000 */
  Mali_WrReg(0x1,0x0,0x318,0x00000000);              /* writereg 10000318 00000000 */
  Mali_WrReg(0x1,0x0,0x31c,0x00000000);              /* writereg 1000031c 00000000 */
  Mali_WrReg(0x1,0x0,0x320,0x00000000);              /* writereg 10000320 00000000 */
  Mali_WrReg(0x1,0x0,0x324,0x00000000);              /* writereg 10000324 00000000 */
  Mali_WrReg(0x1,0x0,0x328,0x00000000);              /* writereg 10000328 00000000 */
  Mali_WrReg(0x1,0x0,0x32c,0x00000000);              /* writereg 1000032c 00000000 */
  /* COMMENT */                                      /* #- Management registers */
  Mali_WrReg(0x1,0x0,0x1000,0x00000000);             /* writereg 10001000 00000000 */
  Mali_WrReg(0x1,0x0,0x1004,0x00000000);             /* writereg 10001004 00000000 */
  Mali_WrReg(0x1,0x0,0x1008,0x00000000);             /* writereg 10001008 00000000 */
  /* COMMENT */                                      /* # Skip Control Management register at 0x100c */
  Mali_WrReg(0x1,0x0,0x1010,0x00000000);             /* writereg 10001010 00000000 */
  Mali_WrReg(0x1,0x0,0x1014,0x00000000);             /* writereg 10001014 00000000 */
  Mali_WrReg(0x1,0x0,0x1018,0x00000000);             /* writereg 10001018 00000000 */
  Mali_WrReg(0x1,0x0,0x101c,0x00000000);             /* writereg 1000101c 00000000 */
  Mali_WrReg(0x1,0x0,0x1020,0x00000000);             /* writereg 10001020 00000000 */
  Mali_WrReg(0x1,0x0,0x1024,0xffffffff);             /* writereg 10001024 ffffffff # Clear all interrupts */
  Mali_WrReg(0x1,0x0,0x1028,0x00000000);             /* writereg 10001028 00000000 */
  Mali_WrReg(0x1,0x0,0x102c,0x00000000);             /* writereg 1000102c 00000000 */
  Mali_WrReg(0x1,0x0,0x1030,0x00000000);             /* writereg 10001030 00000000 */
  Mali_WrReg(0x1,0x0,0x1034,0x00000000);             /* writereg 10001034 00000000 */
  Mali_WrReg(0x1,0x0,0x1038,0x00000000);             /* writereg 10001038 00000000 */
  Mali_WrReg(0x1,0x0,0x103c,0x00000000);             /* writereg 1000103c 00000000 */
  Mali_WrReg(0x1,0x0,0x1040,0x00000000);             /* writereg 10001040 00000000 */
  Mali_WrReg(0x1,0x0,0x1044,0x00000000);             /* writereg 10001044 00000000 */
  Mali_WrReg(0x1,0x0,0x1048,0x00000000);             /* writereg 10001048 00000000 */
  Mali_WrReg(0x1,0x0,0x104c,0x00000000);             /* writereg 1000104c 00000000 */
  Mali_WrReg(0x1,0x0,0x1050,0x00000000);             /* writereg 10001050 00000000 */
  Mali_WrReg(0x1,0x0,0x1054,0x00000000);             /* writereg 10001054 00000000 */
  Mali_WrReg(0x1,0x0,0x1058,0x00000000);             /* writereg 10001058 00000000 */
  Mali_WrReg(0x1,0x0,0x105c,0x00000000);             /* writereg 1000105c 00000000 */
  Mali_WrReg(0x1,0x0,0x1060,0x00000000);             /* writereg 10001060 00000000 */
  Mali_WrReg(0x1,0x0,0x1064,0x00000000);             /* writereg 10001064 00000000 */
  Mali_WrReg(0x1,0x0,0x1068,0x00000000);             /* writereg 10001068 00000000 */
  Mali_WrReg(0x1,0x0,0x106c,0x00000000);             /* writereg 1000106c 00000000 */
  Mali_WrReg(0x1,0x0,0x1070,0x00000000);             /* writereg 10001070 00000000 */
  Mali_WrReg(0x1,0x0,0x1074,0x00000000);             /* writereg 10001074 00000000 */
  Mali_WrReg(0x1,0x0,0x1078,0x00000000);             /* writereg 10001078 00000000 */
  Mali_WrReg(0x1,0x0,0x107c,0x00000000);             /* writereg 1000107c 00000000 */
  Mali_WrReg(0x1,0x0,0x1080,0x00000000);             /* writereg 10001080 00000000 */
  Mali_WrReg(0x1,0x0,0x1084,0x00000000);             /* writereg 10001084 00000000 */
  Mali_WrReg(0x1,0x0,0x1088,0x00000000);             /* writereg 10001088 00000000 */
  Mali_WrReg(0x1,0x0,0x108c,0x00000000);             /* writereg 1000108c 00000000 */
  Mali_WrReg(0x1,0x0,0x1090,0x00000000);             /* writereg 10001090 00000000 */
  Mali_WrReg(0x1,0x0,0x1094,0x00000000);             /* writereg 10001094 00000000 */
  Mali_WrReg(0x1,0x0,0x1098,0x00000000);             /* writereg 10001098 00000000 */
  Mali_WrReg(0x1,0x0,0x109c,0x00000000);             /* writereg 1000109c 00000000 */
  Mali_WrReg(0x1,0x0,0x10a0,0x00000000);             /* writereg 100010a0 00000000 */
  Mali_WrReg(0x1,0x0,0x10a4,0x00000000);             /* writereg 100010a4 00000000 */
  Mali_WrReg(0x1,0x0,0x10a8,0x00000000);             /* writereg 100010a8 00000000 */
  Mali_WrReg(0x1,0x0,0x10ac,0x00000000);             /* writereg 100010ac 00000000 */
  Mali_WrReg(0x1,0x0,0x10b0,0x00000000);             /* writereg 100010b0 00000000 */
  Mali_WrReg(0x1,0x0,0x10b4,0x00000000);             /* writereg 100010b4 00000000 */
  Mali_WrReg(0x1,0x0,0x10b8,0x00000000);             /* writereg 100010b8 00000000 */
  Mali_WrReg(0x1,0x0,0x10bc,0x00000000);             /* writereg 100010bc 00000000 */
  /* COMMENT */                                      /* #- Dump */
  res |= Check_m400_pp_0_ibr02_check_0_f();          /* dump_reg 10000000 10000058 > ibr02_00010_reg.hex # Frame registers */
  res |= Check_m400_pp_0_ibr02_check_0_g();          /* dump_reg 10000100 10000130 > ibr02_00011_reg.hex # Writeback Registers for WB0 */
  res |= Check_m400_pp_0_ibr02_check_0_h();          /* dump_reg 10000200 10000230 > ibr02_00012_reg.hex # Writeback Registers for WB1 */
  res |= Check_m400_pp_0_ibr02_check_0_i();          /* dump_reg 10000300 10000330 > ibr02_00013_reg.hex # Writeback Registers for WB2 */
  res |= Check_m400_pp_0_ibr02_check_0_j();          /* dump_reg 10001000 100010b8 > ibr02_00014_reg.hex # Management registers */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* # Write "random" values */
  /* COMMENT */                                      /* # */
  /* COMMENT */                                      /* #- Frame registers */
