alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/pp0/m400_pp_0_ibr02_run.c
int Check_m400_pp_0_ibr02_check_0_a () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_a.data_10000000,1,0,0x0,0x58);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_b () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_b.data_10000100,1,0,0x100,0x130);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_c () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_c.data_10000200,1,0,0x200,0x230);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_d () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_d.data_10000300,1,0,0x300,0x330);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_e () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_e.data_10001000,1,0,0x1000,0x10b8);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_f () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_f.data_10000000,1,0,0x0,0x58);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_g () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_g.data_10000100,1,0,0x100,0x130);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_h () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_h.data_10000200,1,0,0x200,0x230);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_i () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_i.data_10000300,1,0,0x300,0x330);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_j () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_j.data_10001000,1,0,0x1000,0x10b8);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_k () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_k.data_10000000,1,0,0x0,0x58);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_l () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_l.data_10000100,1,0,0x100,0x130);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_m () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_m.data_10000200,1,0,0x200,0x230);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_n () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_n.data_10000300,1,0,0x300,0x330);
  return res;
};

int Check_m400_pp_0_ibr02_check_0_o () {
  int res = 0;
  res |= Mali_CompareRegs(CheckData_m400_pp_0_ibr02_check_0_o.data_10001000,1,0,0x1000,0x10b8);
  return res;
};
